Tekla Open API Reference for Tekla Structures 2025
BaseComponent.ConnectionCodeFromAttributeFile Field
 A constant string defining that the connection code is to be read from the attribute file. The connection code must be set to this constant value before inserting the component.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string ConnectionCodeFromAttributeFile = "CodeFromAttrFile"
Public Const ConnectionCodeFromAttributeFile As String = "CodeFromAttrFile"
Field Value
Type: String
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace